           02 REG-NR        pic x(4)     value spaces.
           02 BANKNAVN      pic x(30)    value spaces.
           02 BANKADDRESSE  pic x(50)    value spaces.
           02 TELEFON       pic x(15)    value spaces.
           02 EMAIL         pic x(30)    value spaces.
           