           02 WS-BELOB-DKK-NUM    PIC S9(13)V99 COMP-3 VALUE 0.
           02 KURS-USD-TIL-DKK    PIC 9V9999       VALUE 6.9000.
           02 KURS-EUR-TIL-DKK    PIC 9V9999       VALUE 7.4500.
