      IDENTIFICATION DIVISION.
      PROGRAM-ID. Hello.
      data division.
      WORKING-STORAGE SECTION.
      procedure division.
     *> Jeg skal lave et display, der faar cobol til at skrive
     *> til konsollen.
      display "Hello, World!".
      stop run.    
